update for agent + caddy
Signed-off-by: Yussuf Shaikh <yussuf.shaikh1@ibm.com>
